In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

data = pd.read_csv('truncated_dataset.csv')
data.head()

,transaction_id,date,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,...,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards,mcc_description
0,7476386,2010-01-01 09:27:00,1046,27.690001,Swipe Transaction,20561,Bastrop,TX,78602.0,5912,...,Female,723 Fourth Drive,41.90,-72.08,25399.0,51788.0,77642.0,675,2,Drug Stores and Pharmacies
1,7484578,2010-01-03 10:56:00,2931,579.710022,Swipe Transaction,7257,Titusville,FL,32796.0,3260,...,Female,990 North Lane,30.36,-87.17,20045.0,29164.0,19851.0,625,4,Pottery and Ceramics
2,7483134,2010-01-03 03:21:00,2493,110.680000,Swipe Transaction,35451,Williston Park,NY,11596.0,5812,...,Male,455 Little Creek Boulevard,40.75,-73.64,39705.0,80957.0,161166.0,683,6,Eating Places and Restaurants
3,7480544,2010-01-02 10:19:00,2495,3.330000,Swipe Transaction,50783,Weatherford,TX,76086.0,5411,...,Female,557 Burns Boulevard,32.75,-97.77,19120.0,19581.0,21424.0,706,3,"Grocery Stores, Supermarkets"
4,7480474,2010-01-02 10:02:00,233,49.599998,Online Transaction,39021,ONLINE,NaN,NaN,4784,...,Male,865 Wessex Lane,36.15,-85.50,15955.0,32531.0,78193.0,631,4,Tolls and Bridge Fees

In [24]:
df_1 = data[['date','transaction_id','card_brand','card_brand','card_type','merchant_id', 'mcc','mcc_description', 'amount']]
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             20000 non-null  object
 1   transaction_id   20000 non-null  int64
 2   card_brand       20000 non-null  object
 3   card_brand       20000 non-null  object
 4   card_type        20000 non-null  object
 5   merchant_id      20000 non-null  int64
 6   mcc              20000 non-null  int64
 7   mcc_description  20000 non-null  object
 8   amount           20000 non-null  float64
dtypes: float64(1), int64(3), object(5)
memory usage: 1.4+ MB

In [25]:
most_transactions = df_1['merchant_id'].value_counts().idxmax()
print(f'The merchant with the highest number of transactions is: {most_transactions}')

merchant_mt_df = df_1[df_1['merchant_id'] == most_transactions]

The merchant with the highest number of transactions is: 59935

In [26]:
merchant_mt_df.sort_values(by='date', inplace=True)
merchant_mt_df.head()

C:\Users\matth\AppData\Local\Temp\ipykernel_13232\3519257169.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  merchant_mt_df.sort_values(by='date', inplace=True)

,date,transaction_id,card_brand,card_brand,card_type,merchant_id,mcc,mcc_description,amount
5082,2010-01-01 00:01:00,7475327,Mastercard,Mastercard,Debit (Prepaid),59935,5499,Miscellaneous Food Stores,-77.000000
7005,2010-01-01 00:09:00,7475334,Mastercard,Mastercard,Debit (Prepaid),59935,5499,Miscellaneous Food Stores,77.000000
1487,2010-01-01 00:26:00,7475340,Mastercard,Mastercard,Debit (Prepaid),59935,5499,Miscellaneous Food Stores,39.630001
4504,2010-01-01 04:58:00,7475518,Amex,Amex,Credit,59935,5499,Miscellaneous Food Stores,2.680000
19992,2010-01-01 06:01:00,7475573,Mastercard,Mastercard,Debit (Prepaid),59935,5499,Miscellaneous Food Stores,95.000000

In [28]:
m2 = merchant_mt_df[['date', 'transaction_id', 'amount']]

m2.head()

                      date  transaction_id     amount
5082   2010-01-01 00:01:00         7475327 -77.000000
7005   2010-01-01 00:09:00         7475334  77.000000
1487   2010-01-01 00:26:00         7475340  39.630001
4504   2010-01-01 04:58:00         7475518   2.680000
19992  2010-01-01 06:01:00         7475573  95.000000

In [37]:
m2['month'] = pd.to_datetime(m2['date']).dt.to_period('M')

print(m2.head())
print('---')
print(m2.tail())

                      date  transaction_id     amount    month
5082   2010-01-01 00:01:00         7475327 -77.000000  2010-01
7005   2010-01-01 00:09:00         7475334  77.000000  2010-01
1487   2010-01-01 00:26:00         7475340  39.630001  2010-01
4504   2010-01-01 04:58:00         7475518   2.680000  2010-01
19992  2010-01-01 06:01:00         7475573  95.000000  2010-01
---
                      date  transaction_id      amount    month
19691  2010-01-09 15:22:00         7509001  -88.000000  2010-01
18789  2010-01-09 15:30:00         7509030   35.939999  2010-01
19658  2010-01-09 15:31:00         7509037  -61.000000  2010-01
18757  2010-01-09 15:32:00         7509041   52.320000  2010-01
19730  2010-01-09 16:37:00         7509304  100.000000  2010-01

C:\Users\matth\AppData\Local\Temp\ipykernel_13232\1591623898.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m2['month'] = pd.to_datetime(m2['date']).dt.to_period('M')